thexhr/update-dragonfly/client/update-dragonfly.8
.\"-
.\" Copyright (c) 2007 Matthias Schmidt <schmidtm@mathematik.uni-marburg.de>
.\"
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions are met:
.\"
.\" - Redistributions of source code must retain the above copyright notice,
.\"   this list of conditions and the following disclaimer.
.\" - Redistributions in binary form must reproduce the above copyright notice,
.\"   this list of conditions and the following disclaimer in the documentation
.\"   and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
.\" "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
.\" LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
.\" A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
.\" CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
.\" EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
.\" PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
.\" PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
.\" LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
.\" NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
.\" SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd December 17, 2007
.Dt UPDATE_DRAGONFLY 8
.Os
.Sh NAME
.Nm update-dragonfly
.Nd provides binary update functionality for
.Dx
.Sh SYNOPSIS
.Nm
.Op Fl ghinrv
.Op Fl f Ar config-file
.Sh DESCRIPTION
.Nm
checks if updates for
.Dx
are available on a server.  If yes, the user can get and install these
updates.
.Nm
provides a backup function so that accidently installed updates can be
reinstalled.
The options are as follows:
.Bl -tag -width indent
.It Fl f Ar configfile
Use this config file
.It Fl g
Get available updates
.It Fl h
Print usage
.It Fl i
Install previous fetched updates
.It Fl n
Do not actually install updates.  Just report all
install steps taken
.It Fl r
Reinstall previously backed up files
.It Fl v
Be more verbose
.El
.Sh EXAMPLES
The following is an example of a typical usage
of the
.Nm
command to get available updates.
.Pp
.Dl "update-dragonfly -v -g"
.Pp
To install the updates type
.Dl "update-dragonfly -v -i"
.Pp
If an error occured you can reinstall backed up files:
.Dl "update-dragonfly -v -r"
.Sh SEE ALSO
.Xr bsdiff 1 ,
.Xr bspatch 1 
.Sh AUTHORS
.Nm
was written by
.An Matthias Schmidt Aq schmidtm@mathematik.uni-marburg.de .
